2021-2023/TNCO/Packages/rfs_smsbundle_ansible/Contains/rfs_smsbundle_ansible/Lifecycle/ansible/roles/createmms/templates/nokia_provisioning_gw_enum_provide_request.xml.j2

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ= "http://www.netnumber.com/titan/view/soap/types">
	<soapenv:Header/>
	<soapenv:Body>
		<typ:ChangeRequest view="{{ ENUM_ChangeRequest_view }}">
			<typ:entry>number='{{ GPSI }}' subscriber-id="{{ GPSI }}" rrid={{ ENUM_rrid }} NAPTR {ttl={{ ENUM_ttl }} order={{ ENUM_order }} preference=50 flags="{{ ENUM_flags }}" service="{{ ENUM_service }}" regexp="!^(.*)$!mailto: +{{ GPSI }}@mms.mnc340.mcc313.gprs!" replacement={{ ENUM_replacement }}}</typ:entry>
		</typ:ChangeRequest>
	</soapenv:Body>
</soapenv:Envelope>